cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'silinternational/tap'
tap 'havoc-io/mutagen'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'wget'
#brew 'zsh'
#brew 'zsh-completions'
brew 'libtiff'
brew 'libtool'
brew 'ssh-audit'
brew 'awscli'
brew 'sqlparse'
brew 'telnet'
brew 'jq'
brew 'tree'
brew 'bat'                          # alternative to cat command
brew 'prettyping'                   # wrapper around ping
brew 'fzf'                          # alternative to CTRL+R
brew 'diff-so-fancy'                # alternative to git diff
brew 'git'
brew 'deployer'
#brew 'getantibody/tap/antibody'
brew 'hub'
brew 'php@7.4'
brew 'composer'                     # git extension to interact with github
brew 'node@14'
brew 'yarn', args: ["ignore-dependencies"]
brew 'muesli/homebrew-tap/duf'
brew 'todo-txt'
brew 'serverless'
brew 'mkcert'

###
# video tools
###
#brew 'avidemux'
brew 'ffmpeg'
brew 'youtube-dl'
cask 'handbrake'

###
# SRE TOOLS
###
brew 'kubectl'
brew 'helm'
brew 'krew'
brew 'eksctl'
brew 'fluxctl'
brew 'minikube'


cask 'firefox'
cask 'iterm2'
cask 'postman'
cask 'transmission'
cask 'vlc'
cask 'keepingyouawake'
cask 'spotify'
cask 'spotify-notifications'
cask 'atom'
cask 'jetbrains-toolbox'
cask 'rectangle'
cask 'slack'
cask 'gpg-suite'
cask 'whatsapp'
cask 'cyberduck'
cask 'java'
cask 'authy'                        # Authy desktop
cask 'font-jetbrains-mono'          # Jetbrains mono font
cask 'bettertouchtool'
cask 'visual-studio-code'
cask 'keka'                         # The macOS file archiver
