cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'silinternational/tap'
tap 'havoc-io/mutagen'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'dnsmasq'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'libtiff'
brew 'libtool'
brew 'youtube-dl'
brew 'ssh-audit'
brew 'exa'
brew 'awscli'
brew 'sqlparse'
brew 'telnet'
brew 'jq'
brew 'ecs-deploy'
brew 'tree'
brew 'bat'                          # alternative to cat command
brew 'prettyping'                   # wrapper around ping
brew 'fzf'                          # alternative to CTRL+R
brew 'diff-so-fancy'                # alternative to git diff
brew 'git'
brew 'go'
brew 'ffmpeg'
brew 'mutagen'
brew 'deployer'
brew 'getantibody/tap/antibody'
brew 'hub'
brew 'php@7.4'
brew 'composer'                     # git extension to interact with github
brew 'kubectl'
brew 'yarn'
brew 'serverless'

cask 'handbrake'
cask 'firefox'
cask 'iterm2'
cask 'postman'
cask 'skype'
cask 'transmission'
cask 'vlc'
cask 'keepingyouawake'
cask 'spotify'
cask 'spotify-notifications'
cask 'atom'
cask 'jetbrains-toolbox'
cask 'rectangle'
cask 'slack'
cask 'gpg-suite'
cask 'whatsapp'
cask 'cyberduck'
cask 'java'
cask 'mysqlworkbench'
cask 'authy'                        # Authy desktop
cask 'font-jetbrains-mono'          # Jetbrains mono font
cask 'bettertouchtool'
